In [1]:
# import Libraries
import pandas as pd
import sweetviz as sv
import numpy as np
import os
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
df_covid_age=pd.read_excel(r"C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\COVID\age_group_pivot.xlsx",index_col=False)

In [3]:
df_covid_age.head()

   year    state     age_group  covid_cases
0  2020  Alabama  0 - 17 years        30459
1  2020  Alabama         18-49       140794
2  2020  Alabama         50-64        56072
3  2020  Alabama           65+        45457
4  2020  Alabama       Unknown        86763

In [7]:
# Delete row(s) containing specific column value(s)
df_covid_age.drop(df_covid_age.index[df_covid_age['age_group']=='0 - 17 years'],inplace=True) 
df_covid_age.reset_index(inplace=True)

In [8]:
df_suicide_age=pd.read_excel(r"C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\Suicide\age_groups_suicides-3.xlsx",index_col=False)

In [9]:
df_suicide_age.head()

   year    state age_group  suicide_deaths
0  2019  Alabama     18-49            25.0
1  2019  Alabama     50-64            22.9
2  2019  Alabama     50-64            23.1
3  2019  Alabama       65+            20.9
4  2019  Alabama       65+            17.6

In [10]:
df=df_covid_age.merge(df_suicide_age,on=['year','state','age_group'],how='outer')

In [14]:
df.drop(columns=['index'],inplace=True)

In [15]:
df.sort_values(by=['year','state','age_group'],ascending=True,inplace=True)

In [16]:
df.head()

      year    state age_group  covid_cases  suicide_deaths
1075  2019  Alabama     18-49          NaN            25.0
1076  2019  Alabama     50-64          NaN            22.9
1077  2019  Alabama     50-64          NaN            23.1
1078  2019  Alabama       65+          NaN            20.9
1079  2019  Alabama       65+          NaN            17.6

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1488 entries, 1075 to 1074
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            1488 non-null   int64
 1   state           1488 non-null   object
 2   age_group       1488 non-null   object
 3   covid_cases     1075 non-null   float64
 4   suicide_deaths  1187 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 69.8+ KB

In [19]:
df.to_excel(r'C:\Users\drmat\OneDrive\Documents\Career Foundry\COVID_Suicide\02 Data\02 Prepared\Combined\age_group.xlsx')